---
kind: method
id: M:Autodesk.Revit.DB.Analysis.HVACLoadSpaceType.IsNameUnique(Autodesk.Revit.DB.Document,System.String)
source: html/cbb6c51d-13f8-b09a-4600-7ba60f9fe6f0.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadSpaceType.IsNameUnique Method

Determines whether a potential space type name is unique.

## Syntax (C#)
```csharp
public static bool IsNameUnique(
	Document document,
	string name
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.
- **name** (`System.String`) - The candidate name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null